#if!defined( _ENGINE_H_INCLUDED_)
#define _ENGINE_H_INCLUDED_


#include <SFML/Graphics.hpp>
using namespace sf;

// Определение игрового окна (для работы с ним подключить файл engine.h и использовать объект window)
//
RenderWindow window(sf::VideoMode(1200, 600), "Bounce");
//
// Массив карты (после загрузки карты к нему можно обращаться, чтобы проверять границы)
//
static const int HEIGHT_MAP = 25;//размер карты высота
static const int WIDTH_MAP = 40;//размер карты ширина 
//
String TileMap[HEIGHT_MAP] = {// определение карты (В БУДУЩЕМ СДЕЛАТЬ ЗАГРУЗКУ ИЗ ФАЙЛА)
	"0000000000000000000000000000000000000000",
	"0000000000000000000++++++++            0",
	"0      000000000000                    0",
	"0      000000000000                    0",
	"0      000000000000                    0",
	"0                                      0",
	"0                                      0",
	"0                 0 Abb                0",
	"0                 0                    0",
	"0               000                    0",
	"0                 0Abbbbbbb            0",
	"0             00000--------            0",
	"0000000RRRRR0000000000000000000000000000",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0000000000000000000000000000000000000000",
};


#endif // !_ENGINE_H_INCLUDED_